main.org
#+title: Main

This document describes the VariaMos Semantic Translator.
It is an interactive notebook written in Org-Mode with python literate programming features.
It is similar to but more powerful than Jupyter notebooks since it is fully customizable and it provides a superior code editing experience.

* Introduction
The purpose of this software is to take in VariaMos-formatted JSON with a model
of some type, and, using a set of transformation rules:
(a) generate a machine-interpretable represenation of the model;
(b) execute the model in the chosen langugage;
(c) and, return any diagnostic info to VariaMos.

We now turn to defining where we will find our files for processing:

#+begin_src python :session s1 :results none
FILE = "/home/kaiser185/workspace/semantic_translator/json/vmosfm.json"
RULES = "/home/kaiser185/workspace/semantic_translator/json/fmrules.json"
#+end_src

#+RESULTS:

* Function for transforming the templates
Now that we have our imports and files, we shall create a set of functions that will perform the transformation of a given constraint template into the necessary text:

#+begin_src python :session s1 :results none
import json
import re
from minizinc import Instance, Model, Solver

def replaceWithPattern(pattern, string, occ, v):
    if type(v) is not str and string is not None:
        print(v.items())
        print(string)
        [string := string.replace(occ, str(val)) for (k, val) in v.items()]
        print('OK')
        return string


def replaceExprs(bundle, elems, rels, cons, params, complexT):
    f = [iden for (k, r) in rels.items() for ((iden,_), _) in elems.items() if (str(r["sourceId"]) == str(iden) and str(r["targetId"]) == str(bundle["id"]))]
    # replace constraint for principal param
    fs = [
        iden
        for ((iden, _), elem)
        in elems.items()
        if ([rel for (_,rel) in rels.items() if rel["sourceId"] == bundle["id"] and rel["targetId"] == iden])
    ]
    fs = ["uuid_" + ef.replace("-","_") for ef in fs if (ef not in f)]
    print(fs)
    pattern = {
        "F": f[0],
        "Xs": {
            "sum":" + ".join(fs),
        }
    }
    cons = str(cons).replace(params[0], "uuid_" + pattern[params[0]].replace("-","_"))
    funs = r"(" + r"|".join(complexT["functions"]) + r")"
    regex_paren = funs + r"\(" + re.escape(params[1]) + r"\)"
    occs = set([oc.group(0) for oc in re.finditer(regex_paren, cons)])
    [cons := cons.replace(occ, pattern[params[1]][re.compile(regex_paren).search(occ).group(1)]) for occ in occs]
    return cons


def replaceExpr(bundle, elems, rels, cons, param):
    print(param)
    regex_norm = re.escape(param)
    regex_paren = r"(\w*[(]" + re.escape(param) + r"[)])"
    occs = set([oc.group(0) for oc in re.finditer(regex, cons)])
    print(occs)
    f = [iden for (k, r) in rels.items() for ((iden,_), _) in elems.items() if (str(r["sourceId"]) == str(iden) and str(r["targetId"]) == str(bundle["id"]))]
    fs = [
        iden
        for ((iden, _), elem)
        in elems.items()
        if ([rel for (_,rel) in rels.items() if rel["sourceId"] == bundle["id"] and rel["targetId"] == iden])
    ]
    fs = ["uuid_" + ef.replace("-","_") for ef in fs if (ef not in f)]
    print(fs)
    pattern = {
        "F": f[0],
        "Xs": {
            "sum":" + ".join(fs),
        }
    }
    print(pattern)
    # p = "Fs"
    print(cons)
    [
        cons := (str(cons).replace(occ, v)
        if (pat == param and type(v) == str)
        else replaceWithPattern(pat, cons, occ, v))
        for (pat, v) in pattern.items()
        for occ in occs
    ]
    return cons


def bundleCons(bundle, elems, rels, rules):
    # get constraint rule
    rule = rules["elementTranslationRules"][0]["Bundle"]
    cons = rule["constraint"][bundle["properties"][1]["value"]]
    complexTrans = rules["complexElemTranslations"]
    return replaceExprs(bundle, elems, rels, cons, rule["param"], complexTrans)


def mapBundles(elems, rels, rules):
    return [
        bundleCons(bs, elems, rels, rules)
        for bs in [
            e if e["type"] == "Bundle" else None for ((iden, typ), e) in elems.items()
        ]
        if bs is not None
    ]


def mapVar(element, rule):
    # return rule
    if bool(rule):
        constraint = (
            rule["constraint"].replace(
                rule["param"], str(element["id"]).replace("-", "_")
            )
            + f'% {element["type"]} -> {element["id"]}'
        )
        return constraint
    # If not bool(rule) then return None


def mapVars(elems, rules):
    return [
        cs
        for cs in [
            mapVar(element, rules["elementTranslationRules"][0][typ])
            if (typ in rules["elementTypes"])
            else None
            for ((ident, typ), element) in elems.items()
        ]
        if cs is not None
    ]


def mapCons(relation, rule):
    if bool(rule):
        acc = rule["constraint"]
        [
            acc := acc.replace(
                p,
                str(
                    relation[("source" if p == rule["params"][0] else "target") + "Id"]
                ).replace("-", "_"),
            )
            for p in rule["params"]
        ]
        return acc


def mapRels(relations, rules):
    return [
        rs
        for rs in [
            mapCons(
                v, rules["relationTranslationRules"][0][v["properties"][0]["value"]]
            )
            for (k, v) in [
                (k, rel) for (k, rel) in relations.items() if rel["properties"]
            ]
            if (v["properties"][0]["value"] in rules["relationTypes"])
        ]
        if rs is not None
    ]
#+end_src

Next we need to construct our result:

#+begin_src python :session s1 :results output :exports both
# Load file
with open(FILE, "r") as f:
    # Load json as obj
    array = json.load(f)
    # Get the feature model @ /productLines[0]/domainEngineering/models[0]
    fm = array["productLines"][0]["domainEngineering"]["models"][0]
    # Get the elements
    elementsMap = {(e["id"], e["type"]): e for e in fm["elements"]}
    # Get the relationships
    relationsMap = {r["id"]: r for r in fm["relationships"]}
    # Create the rules
    with open(RULES, "r") as r:
        rules = json.load(r)
        # Map the constraints for the vars
        constraints = (
            mapVars(elementsMap, rules)
            + mapRels(relationsMap, rules)
            + mapBundles(elementsMap, relationsMap, rules)
            + ["solve satisfy;"]
        )
        print(constraints)
        print("-------------------------------------------------------")
        print("\n".join([c for c in constraints]))
        # Add model and solver
        gecode = Solver.lookup("gecode")
        model = Model()
        model.add_string("\n".join([c for c in constraints]))
        instance = Instance(gecode, model)
        result = instance.solve()
        print(result)

#+end_src

#+RESULTS:
#+begin_example
['uuid_43634fef_d816_4cc4_bbde_02cb7865afef', 'uuid_87b866ef_e358_4797_829c_d3fcac43a21f']
["var 1..1:'uuid_69784178_c589_4447_bbe5_7b51b97f4918';% RootFeature -> 69784178-c589-4447-bbe5-7b51b97f4918", "var 0..1:'uuid_bf3ab018_6304_4e84_a11f_80f3f5d1d80f';% AbstractFeature -> bf3ab018-6304-4e84-a11f-80f3f5d1d80f", "var 0..1:'uuid_ac0d2916_749b_4146_ad32_37622e2aeef0';% AbstractFeature -> ac0d2916-749b-4146-ad32-37622e2aeef0", "var 0..1:'uuid_9e5a250c_9ee7_4d7b_9486_40563a1e9ab8';% ConcreteFeature -> 9e5a250c-9ee7-4d7b-9486-40563a1e9ab8", "var 0..1:'uuid_43634fef_d816_4cc4_bbde_02cb7865afef';% ConcreteFeature -> 43634fef-d816-4cc4-bbde-02cb7865afef", "var 0..1:'uuid_87b866ef_e358_4797_829c_d3fcac43a21f';% ConcreteFeature -> 87b866ef-e358-4797-829c-d3fcac43a21f", "var 0..1:'uuid_e51771f2_b0cc_433a_bfee_8e106bb8d17e';% AbstractFeature -> e51771f2-b0cc-433a-bfee-8e106bb8d17e", "var 0..1:'uuid_1cb2b338_f05e_4ccb_9df2_2bc76894336a';% ConcreteFeature -> 1cb2b338-f05e-4ccb-9df2-2bc76894336a", "var 0..1:'uuid_b2f0093c_60b1_40a0_98d6_ab392dcc74cc';% ConcreteFeature -> b2f0093c-60b1-40a0-98d6-ab392dcc74cc", 'constraint :: "69784178_c589_4447_bbe5_7b51b97f4918 mandatory bf3ab018_6304_4e84_a11f_80f3f5d1d80f" (uuid_69784178_c589_4447_bbe5_7b51b97f4918 == uuid_bf3ab018_6304_4e84_a11f_80f3f5d1d80f);', 'constraint :: "69784178_c589_4447_bbe5_7b51b97f4918 mandatory ac0d2916_749b_4146_ad32_37622e2aeef0" (uuid_69784178_c589_4447_bbe5_7b51b97f4918 == uuid_ac0d2916_749b_4146_ad32_37622e2aeef0);', 'constraint :: "bf3ab018_6304_4e84_a11f_80f3f5d1d80f optional 9e5a250c_9ee7_4d7b_9486_40563a1e9ab8" (uuid_bf3ab018_6304_4e84_a11f_80f3f5d1d80f >= uuid_9e5a250c_9ee7_4d7b_9486_40563a1e9ab8);', 'constraint :: "ac0d2916_749b_4146_ad32_37622e2aeef0 mandatory e51771f2_b0cc_433a_bfee_8e106bb8d17e" (uuid_ac0d2916_749b_4146_ad32_37622e2aeef0 == uuid_e51771f2_b0cc_433a_bfee_8e106bb8d17e);', 'constraint :: "e51771f2_b0cc_433a_bfee_8e106bb8d17e mandatory 1cb2b338_f05e_4ccb_9df2_2bc76894336a" (uuid_e51771f2_b0cc_433a_bfee_8e106bb8d17e == uuid_1cb2b338_f05e_4ccb_9df2_2bc76894336a);', 'constraint :: "e51771f2_b0cc_433a_bfee_8e106bb8d17e optional b2f0093c_60b1_40a0_98d6_ab392dcc74cc" (uuid_e51771f2_b0cc_433a_bfee_8e106bb8d17e >= uuid_b2f0093c_60b1_40a0_98d6_ab392dcc74cc);', 'constraint :: "b2f0093c_60b1_40a0_98d6_ab392dcc74cc excludes 87b866ef_e358_4797_829c_d3fcac43a21f" not (uuid_b2f0093c_60b1_40a0_98d6_ab392dcc74cc == 1 /\\ uuid_87b866ef_e358_4797_829c_d3fcac43a21f == 1);', 'constraint :: "9e5a250c_9ee7_4d7b_9486_40563a1e9ab8 includes 43634fef_d816_4cc4_bbde_02cb7865afef" (uuid_9e5a250c_9ee7_4d7b_9486_40563a1e9ab8 == 1) -> (uuid_43634fef_d816_4cc4_bbde_02cb7865afef == 1);', 'constraint :: "uuid_bf3ab018_6304_4e84_a11f_80f3f5d1d80f XOR Xs" (uuid_bf3ab018_6304_4e84_a11f_80f3f5d1d80f == 1) -> (uuid_bf3ab018_6304_4e84_a11f_80f3f5d1d80f == uuid_43634fef_d816_4cc4_bbde_02cb7865afef + uuid_87b866ef_e358_4797_829c_d3fcac43a21f);', 'solve satisfy;']
-------------------------------------------------------
var 1..1:'uuid_69784178_c589_4447_bbe5_7b51b97f4918';% RootFeature -> 69784178-c589-4447-bbe5-7b51b97f4918
var 0..1:'uuid_bf3ab018_6304_4e84_a11f_80f3f5d1d80f';% AbstractFeature -> bf3ab018-6304-4e84-a11f-80f3f5d1d80f
var 0..1:'uuid_ac0d2916_749b_4146_ad32_37622e2aeef0';% AbstractFeature -> ac0d2916-749b-4146-ad32-37622e2aeef0
var 0..1:'uuid_9e5a250c_9ee7_4d7b_9486_40563a1e9ab8';% ConcreteFeature -> 9e5a250c-9ee7-4d7b-9486-40563a1e9ab8
var 0..1:'uuid_43634fef_d816_4cc4_bbde_02cb7865afef';% ConcreteFeature -> 43634fef-d816-4cc4-bbde-02cb7865afef
var 0..1:'uuid_87b866ef_e358_4797_829c_d3fcac43a21f';% ConcreteFeature -> 87b866ef-e358-4797-829c-d3fcac43a21f
var 0..1:'uuid_e51771f2_b0cc_433a_bfee_8e106bb8d17e';% AbstractFeature -> e51771f2-b0cc-433a-bfee-8e106bb8d17e
var 0..1:'uuid_1cb2b338_f05e_4ccb_9df2_2bc76894336a';% ConcreteFeature -> 1cb2b338-f05e-4ccb-9df2-2bc76894336a
var 0..1:'uuid_b2f0093c_60b1_40a0_98d6_ab392dcc74cc';% ConcreteFeature -> b2f0093c-60b1-40a0-98d6-ab392dcc74cc
constraint :: "69784178_c589_4447_bbe5_7b51b97f4918 mandatory bf3ab018_6304_4e84_a11f_80f3f5d1d80f" (uuid_69784178_c589_4447_bbe5_7b51b97f4918 == uuid_bf3ab018_6304_4e84_a11f_80f3f5d1d80f);
constraint :: "69784178_c589_4447_bbe5_7b51b97f4918 mandatory ac0d2916_749b_4146_ad32_37622e2aeef0" (uuid_69784178_c589_4447_bbe5_7b51b97f4918 == uuid_ac0d2916_749b_4146_ad32_37622e2aeef0);
constraint :: "bf3ab018_6304_4e84_a11f_80f3f5d1d80f optional 9e5a250c_9ee7_4d7b_9486_40563a1e9ab8" (uuid_bf3ab018_6304_4e84_a11f_80f3f5d1d80f >= uuid_9e5a250c_9ee7_4d7b_9486_40563a1e9ab8);
constraint :: "ac0d2916_749b_4146_ad32_37622e2aeef0 mandatory e51771f2_b0cc_433a_bfee_8e106bb8d17e" (uuid_ac0d2916_749b_4146_ad32_37622e2aeef0 == uuid_e51771f2_b0cc_433a_bfee_8e106bb8d17e);
constraint :: "e51771f2_b0cc_433a_bfee_8e106bb8d17e mandatory 1cb2b338_f05e_4ccb_9df2_2bc76894336a" (uuid_e51771f2_b0cc_433a_bfee_8e106bb8d17e == uuid_1cb2b338_f05e_4ccb_9df2_2bc76894336a);
constraint :: "e51771f2_b0cc_433a_bfee_8e106bb8d17e optional b2f0093c_60b1_40a0_98d6_ab392dcc74cc" (uuid_e51771f2_b0cc_433a_bfee_8e106bb8d17e >= uuid_b2f0093c_60b1_40a0_98d6_ab392dcc74cc);
constraint :: "b2f0093c_60b1_40a0_98d6_ab392dcc74cc excludes 87b866ef_e358_4797_829c_d3fcac43a21f" not (uuid_b2f0093c_60b1_40a0_98d6_ab392dcc74cc == 1 /\ uuid_87b866ef_e358_4797_829c_d3fcac43a21f == 1);
constraint :: "9e5a250c_9ee7_4d7b_9486_40563a1e9ab8 includes 43634fef_d816_4cc4_bbde_02cb7865afef" (uuid_9e5a250c_9ee7_4d7b_9486_40563a1e9ab8 == 1) -> (uuid_43634fef_d816_4cc4_bbde_02cb7865afef == 1);
constraint :: "uuid_bf3ab018_6304_4e84_a11f_80f3f5d1d80f XOR Xs" (uuid_bf3ab018_6304_4e84_a11f_80f3f5d1d80f == 1) -> (uuid_bf3ab018_6304_4e84_a11f_80f3f5d1d80f == uuid_43634fef_d816_4cc4_bbde_02cb7865afef + uuid_87b866ef_e358_4797_829c_d3fcac43a21f);
solve satisfy;
Solution(uuid_69784178_c589_4447_bbe5_7b51b97f4918=1, uuid_bf3ab018_6304_4e84_a11f_80f3f5d1d80f=1, uuid_ac0d2916_749b_4146_ad32_37622e2aeef0=1, uuid_9e5a250c_9ee7_4d7b_9486_40563a1e9ab8=0, uuid_43634fef_d816_4cc4_bbde_02cb7865afef=1, uuid_87b866ef_e358_4797_829c_d3fcac43a21f=0, uuid_e51771f2_b0cc_433a_bfee_8e106bb8d17e=1, uuid_1cb2b338_f05e_4ccb_9df2_2bc76894336a=1, uuid_b2f0093c_60b1_40a0_98d6_ab392dcc74cc=0, _checker='')
#+end_example
